/*题目描述
今天英语课，小表弟的英语老师教了他三个与动物有关的单词，分别是cat、pig和horse，但是粗心的小表弟在写这三个单词的时候经常会写错。
假如小表弟每个单词最多写错一个字母（当然有时候也是会全部写对的，且字母个数是完全正确的）。
你能否编写一个程序，对小表弟写的单词进行自动纠错。
输入
单组输入。
输入一个可能存在单个字母错误的单词。
输出
输出与输入对应的正确单词。
样例输入 Copy
hoose
样例输出 Copy
horse
*/
#include <stdio.h>

int main(int argc, const char *argv[])
{
    char w[6];
    scanf("%s", w);
    // printf("%s", w);
    if (w[0] == 'c' && w[1] == 'a' || w[0] == 'c' && w[2] == 't' || w[1] == 'a' && w[2] == 't')
    {
        printf("cat");
       
    }
    if (w[0] == 'p' && w[1] == 'i' || w[0] == 'p' && w[2] == 'g' || w[2] == 'g'|| w[1] == 'i' && w[2] == 'g')
    {
        printf("pig");
       
    }
    if (w[0] == 'h' && w[1] == 'o' || w[0] == 'h' && w[2] == 'r' || w[1] == 'o' && w[2] == 'r')
    {
        printf("horse");
        
    }
    return 0;
}