/*
题目描述
你弟弟刚刚学会写英语的一(one)、二(two)和三(three)。他在纸上写了好些一二三，可惜有些字母写错 了。已知每个单词最多有一个字母写错了（单词长度肯定不会错），你能认出他写的啥吗？
输入
第一行为单词的个数（不超过 10）。以下每行为一个单词，单词长度正确，且最多有一个字母写错。所有 字母都是小写的。
输出
对于每组测试数据，输出一行，即该单词的阿拉伯数字。输入保证只有一种理解方式。
样例输入 Copy
3
owe
too
theee
样例输出 Copy
1
2
3*/

#include <stdio.h>

int main(int argc, const char *argv[])
{
    int n;
    char w[10][6];
    scanf("%d", &n);
    for (int i = 0; i < n; i++)
    {
        scanf("%s", w[i]);

        if (w[i][0] == 'o' && w[i][1] == 'n' || w[i][0] == 'o' && w[i][2] == 'e' || w[i][1] == 'n' && w[i][2] == 'e')
        {
            printf("%d\n",1);
        }
        if (w[i][0] == 't' && w[i][1] == 'w' || w[i][0] == 't' && w[i][2] == 'o' || w[i][1] == 'w' && w[i][2] == 'o')
        {
            printf("%d\n", 2);
        }
        if (w[i][0] == 't' && w[i][1] == 'h' || w[i][0] == 't' && w[i][2] == 'r' || w[i][1] == 'h' && w[i][2] == 'r')
        {
            printf("%d\n", 3);
        }
    }
    
    return 0;
}